import time


def congrats():
    print('''
יוסף חברי האהוב
אמרו לי שהפתק הוא הכי חשוב
כי מה שווה כזו מתנה
בלי תשומת לב חמה בקטנה

הנשיא יששכר אמר שהיום הכי חשוב בשנה הוא כט אדר שהוא ערב ראש השנה למלכים שבו מונים את השנים למלוכה. ואם התחיל למלוך ביום הזה למחרת כבר נחשב שמלך שנתיים.
מאחל שתמשיך לבנות את עצמך באישיות ובזוגיות
שתמשיך להתלהב ולהתרגש מכל דבר שאתה לומד ועוסק בו
שיהיו לך הברקות ורעיונות מגניבים גם בתורה וגם בלימודים
שתמצא עבודה כיפית ומגניבה שתתאים לך
שתפנק את עצמך, למרות שאני מאמין שאישתך כבר דואגת לזה

אוהב מלאאאאאאאא
מאור :)
    
    ''')


if __name__ == '__main__':
    print("hello world\n")
    while True:
        num = int(input("Enter a number"))
        if num == 25:
            for i in range(25, 0, -1):
                print(i)
                time.sleep(1)
            print("מזל טוב!!!")
            print('\n\n')
            congrats()
            exit(0)
        elif num < 25:
            print("Too low")
            print("Try again...")
        elif num > 25:
            print("Too high")
            print("Try again...")
